app/Controllers/ProjectController.php

    public function index()
    {
        $session = session();
        $userId = $session->get('id');
        $pModel = new ProjectModel();
        $userModel = new UserModel();
        $data1['Project'] = $pModel->where('user_id',$userId)->findAll();
---
SELECT *
FROM `projects`
WHERE `user_id` = '1'

    public function saveProject()
    {
        $session = session();
        $pModel = new ProjectModel();
        $pModel->save([
            'user_id' => $session->get('id'),
            'name' => $this->request->getPost('p_name'),
            'description' => $this->request->getPost('description'),
            'deadline' => $this->request->getPost('deadline'),
        ]);
---
SELECT *
FROM `project`