app/Controllers/SigninController.php

INSERT INTO `users` (`username`, `email`, `password`) VALUES ('jeez', 'a.go@gmail.com', '$2y$10$mRKxbNY73zSbJexXNJ9kzuNkU564xf6xbrkbfdVIcudHuZQxd9ft6')
---
    public function store()
    {
        helper(['form']);
        $rules = [
            'username'          => 'required|min_length[2]|max_length[50]',
            'email'         => 'required|min_length[4]|max_length[100]|valid_email|is_unique[users.email]',
            'password'      => 'required|min_length[4]|max_length[50]',
            'confirmpassword'  => 'matches[password]'
        ];

        if($this->validate($rules)){
            $userModel = new UserModel();
            $data = [
                'username'     => $this->request->getVar('username'),
                'email'    => $this->request->getVar('email'),
                'password' => password_hash($this->request->getVar('password'), PASSWORD_DEFAULT)
            ];
            $userModel->save($data);