app/Controllers/TaskController.php

SELECT *
FROM `projects`
WHERE `user_id` = '3'
---
    public function index($id)
    {
        $session = session();
        $taskModel = new TaskModel();
        $pModel = new ProjectModel();
        $usrModel = new UserModel();
        $search = $this->request->getGet('search');
        if($search) {
            $taskModel = $taskModel->like('name',$search)
                             ->orLike('status',$search)
                             ->orLike('description',$search);
        }
        $data1['Task'] = $taskModel->where('project_id',$id)->findAll();
        $data2['usr'] = $session->get('username');
        $data3['Project'] = $pModel->where('user_id',$session->get('id'))->findAll();