app/Controllers/TaskController.php

    public function index()
    {
        $taskModel = new TaskModel();
        $data['tasks'] = $taskModel->findAll();
---
SELECT *
FROM `tasks`

    public function saveTask()
    {
        $taskModel = new TaskModel();
        $taskModel->save([
            'task_name' => $this->request->getPost('task_name'),
            'description' => $this->request->getPost('description'),
            'deadline' => $this->request->getPost('deadline'),
        ]);
---
INSERT INTO `tasks` (`task_name`, `description`, `deadline`) VALUES ('Example', 'Example descri', '2024-10-17')