app/Controllers/TaskController.php

SELECT *
FROM `tasks`
WHERE `project_id` = '1'
SELECT *
FROM `projects`
WHERE `projects`.`id` = '1'
---
    public function index($id)
    {
        $taskModel = new TaskModel();
        $pModel = new ProjectModel();
        $data1['Task'] = $taskModel->where('project_id',$id)->findAll();
        $data2['Prj'] = $pModel->find($id);

SELECT *
FROM `tasks`
WHERE `tasks`.`id` = '2'
---
    public function editTask($id)
    {
        $taskModel = new TaskModel();
        $data['task'] = $taskModel->find($id);

DELETE FROM `tasks`
WHERE `id` IN ('5')
---
    public function deleteTask($id)
    {
        $taskModel = new TaskModel();
        $taskModel->delete($id);